Python 3.11.2 (tags/v3.11.2:878ead1, Feb  7 2023, 16:38:35) [MSC v.1934 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> """1.
... 
... 컴퓨터의 기능 5가지
... 입력, 기억, 처리, 제어, 출력 기능
... (컴퓨터의 동작 원리와 컴퓨팅 사고력 외울 필요 없다)
... 
... 알고리즘 표현 방법 4가지 : 자연어, 순서도는 (단점이 있어) 많이 쓰지 않고 다른 두가지 방법으로 더많이 표현
... 
... 2. 파이썬과 인사하기
... 3. 파이썬 설치하기
... 4. 소스 코딩 도우미 IDLE 활용하기
... 
... 
... print 표준출력함수
... input 표준입력함수
... 
... // : 몫
... / : 나누기
... ** : 거듭제곱 2**10 = 1024
... 
... import math : math 모듈 불러오기
... import를 써야 math 기능 정상 작동!
