"""변수는 데이터를 저장하고 찾아갈 수 있는 이정표
－type( ) 함수 : 변수 안에 어떤 타입이 있는지 보여주는 함수
= : 대입연산자
오른쪽에 있는 변수중 선언 안된 변수가 있으면 안됨 (8p)
변수는 그릇이다! (담을 수 있다)
대입 연산자의 왼쪽에는 무조건 변수만 올 수 있고, 오른쪽에는 무엇이든(값,
변수, 수식, 함수 등) 올 수 있음 -> 왼쪽에는 상수가 올 수 없다.
var1 = var1+100 여기서 왼쪽은 변수?!

print : 표준 출력 함수 "~을 보여줘!"
p21 와닿지 않을 수 있음 저런식으로 한국말로 쓸 수 있구나 이해
p22 꼭 할 수 있어야함
p23 시험내기 아주 좋다, 꼭 기억하기!, 예약어 다 외울 필요는 없다(시험X)
－나머지 글자들은 영문자, 숫자 혹은 언더바(_)로 구성. 단, 언더바를 제외한
특수 기호는 사용할 수 없음(ex #, ...)
26p. bool까지는 하나의 값을 다루는 기본형 변수 리스트부터는 여러 데이터의 뭉티기(?)
"""

