year = int(input("태어난 해 입력:"))
age = 2023-year+1
print("당신의 나이는 %d입니다."%age)

+로 연결시킬 땐 문자열이여야함.

퍼센트에 쉼표 안 넣는 것 유의
퍼센트 쓸 때 여러개 쓸 떄는 괄호 써야함.

(중요!)%.5f 부동소수점의 소수점 아래 5자리까지 표시 (cf: %.2f 부동소수점의 소수점 아래 2자리까지 표시)
15p : shell이기 때문에 프린트를 생략했을 뿐임!

정식으로 화면 출력하고 싶으면 print()해주어야함 (SHELL인 경우에는 안써도 됨)
(중요!) 16p. 햇갈릴 수 있으니까 잘 보기!
17p. %d는 정수 형태니까 소수점 아래가 짤려버림
숫자에 대해서 나타날 수 있는 타입이 십진수만 있는 건 아니야( 그냥 그렇구나 하고 넘어가도 됨)
%d, %f, %s 기억!!( 17p)
(중요!) %5.1f -> 전체 다섯자리를 잡아서 소숫점 아래 하자리까지만 실수형태로 찍어내줘~
여러줄 주석은 세개 쓰는 것 잊지 말기! (15p)
(19p)파이썬에서 인덱스는 0번부터다!!
(19p) \랑 역슬레시랑 같은 것 (글꼴에 따라 다르게 보임)

역슬레시' : '를 그냥 찍어줘! 이런 느낌. (따옴표안에 따옴표 신경 안써도 되는 느낌)
tab : 그냥 띄어쓰기 보다 더 많이 이동되는 느낌..~

-----

4p 다른 언어는 int 크기에 제한이 있는데 파이썬은 제한 없다. 어 그런갑다~ 넘어가면 됨

(7p<- 다 중요!!) 눈으로 보고 왜 이렇게 되는지 알 수 있어야함!





